app/Controllers/Distrito.php

    public function listar()
    {
        $this->m_distrito->select('distrito.*,provincia.descripcion as nombreProvincia');
        $this->m_distrito->join('provincia', 'provincia.idprovincia = distrito.provincia_idprovincia');
        $datos = $this->m_distrito->get()->getResult();
---
SELECT *
FROM `distrito`