app/Controllers/Ejecutora.php

    public function listar()
    {
        $data = $this->m_ejecutora->select('*')->get()->getResult();
---
SELECT *
FROM `ejecutora`