app/Controllers/Estudiante.php

    public function listar()
    {
        // echo('llego hasta aki');
        $this->m_estudiante->orderBy('fecha_registro', 'desc');
        $datos = $this->m_estudiante->get()->getResult();
---
SELECT *
FROM `estudiante`
ORDER BY `fecha_registro` DESC