app/Controllers/Iiee.php

INSERT INTO `iiee` (`codmodular`, `cod_local`, `descripcion`, `nivel`, `gestion`, `direccion`, `localidad`, `area_geografica`, `provincia_idprovincia`, `distrito_iddistrito`, `ejecutora_idejecutora`, `fecha_registro`) VALUES ('1234567', '234545', 'neuva ie', '1', '1', '', 'dsds', 'rural', '1', '1', '1', '2023-06-16 21:10:36')
---
    public function registrar()
    {
        $validation = \Config\Services::validation();
        $rules = [
            'codmodular' => 'required|is_unique[iiee.codmodular]|min_length[7]|max_length[7]',
        ];
        $validation->setRules($rules);
        if ($validation->withRequest($this->request)->run())
        {
            $fechaActual = new Time('now', 'UTC');
            $fechaFormateada = $fechaActual->format('Y-m-d H:i:s');
            $data = [
                'codmodular' => $this->request->getPost('codmodular'),
                'cod_local' => $this->request->getPost('cod_local'),
                'descripcion' => $this->request->getPost('descripcion'),
                'nivel' => $this->request->getPost('nivel'),
                'gestion' => $this->request->getPost('gestion'),
                'direccion' => $this->request->getPost('direccion'),
                'localidad' => $this->request->getPost('localidad'),
                'area_geografica' => $this->request->getPost('area_geografica'),
                'provincia_idprovincia' => $this->request->getPost('provincia'),
                'distrito_iddistrito' => $this->request->getPost('distrito'),
                'ejecutora_idejecutora' => $this->request->getPost('ugel'),
                'fecha_registro' => $fechaFormateada,
            ];
            $result = $this->m_iiee->insert($data);

SELECT *
FROM `iiee`
ORDER BY `fecha_registro` DESC
---
    public function listar()
    {
        // echo('llego hasta aki');
        $this->m_iiee->orderBy('fecha_registro', 'desc');
        $datos = $this->m_iiee->get()->getResult();

SELECT *
FROM `iiee`
WHERE `codmodular` = '1111111'
---
    public function consultar()//con
    {
        // echo 'entro';
        $ie = $this->m_iiee->where('codmodular', $_POST["id"])->get()->getResult();

UPDATE `iiee` SET `codmodular` = '1111111', `cod_local` = '423434', `descripcion` = 'santa rosa de lima', `nivel` = '2', `gestion` = '1', `direccion` = 'dfsd', `localidad` = 'fdsf', `area_geografica` = 'rural', `provincia_idprovincia` = '1', `distrito_iddistrito` = '1', `ejecutora_idejecutora` = '1'
WHERE `iiee`.`codmodular` IN ('1111111')
---
    public function actualizar()
    {
        // $validation = \Config\Services::validation();
        // $rules = [
        //     'codmodular' => 'required|is_unique[iiee.codmodular]|min_length[7]|max_length[7]',
        // ];
        // $validation->setRules($rules);
        // if ($validation->withRequest($this->request)->run())
        // {
            $data = [
                'codmodular' => $this->request->getPost('codmodular'),
                'cod_local' => $this->request->getPost('cod_local'),
                'descripcion' => $this->request->getPost('descripcion'),
                'nivel' => $this->request->getPost('nivel'),
                'gestion' => $this->request->getPost('gestion'),
                'direccion' => $this->request->getPost('direccion'),
                'localidad' => $this->request->getPost('localidad'),
                'area_geografica' => $this->request->getPost('area_geografica'),
                'provincia_idprovincia' => $this->request->getPost('provincia'),
                'distrito_iddistrito' => $this->request->getPost('distrito'),
                'ejecutora_idejecutora' => $this->request->getPost('ugel'),
            ];
            $estado = $this->m_iiee->update($this->request->getPost('codmodular'),$data);