app/Controllers/Provincia.php

    public function listar()
    {
        $data = $this->provinciaModel->select('*')->get()->getResult();
---
SELECT *
FROM `provincia`